Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# settings.terminal.scrollSpeed.subtitle
source: Multiplier applied to terminal scroll wheel and trackpad deltas. Higher scrolls faster.
ar: المضاعف المطبق على الفروق في عجلة تمرير الطرفية ولوحة التتبع. القيم الأعلى تمرر بشكل أسرع.
de: Multiplikator für Terminal-Mausrad- und Trackpad-Deltas. Höhere Werte scrollen schneller.
es: Multiplicador aplicado a los cambios de la rueda de desplazamiento y del trackpad de la terminal. Un valor más alto desplaza más rápido.
fr: Multiplicateur appliqué aux deltas de la molette de défilement et du pavé tactile du terminal. Une valeur plus élevée fait défiler plus vite.
ja: ターミナルのスクロールホイールとトラックパッドの移動量に適用される倍率です。大きいほど速くスクロールします。
ko: 터미널 스크롤 휠 및 트랙패드 델타에 적용되는 승수입니다. 높은 값일수록 더 빠르게 스크롤됩니다.
zh_hans: 应用于终端滚轮和触控板增量的倍数。数值越大滚动越快。
zh_hant: 套用至終端機滾輪與軌跡板位移量的倍數。數值越高，捲動越快。

# settings.terminal.sessionContentAlignment
source: Session Content Alignment
ar: محاذاة محتوى الجلسة
de: Ausrichtung des Sitzungsinhalts
es: Alineación del contenido de la sesión
fr: Alignement du contenu de la session
ja: セッションコンテンツの配置
ko: 세션 콘텐츠 정렬
zh_hans: 会话内容对齐
zh_hant: 工作階段內容對齊方式

# settings.terminal.sessionContentAlignment.center
source: Center
ar: وسط
de: Zentriert
es: Centro
fr: Centrer
ja: 中央
ko: 가운데
zh_hans: 居中
zh_hant: 置中

# settings.terminal.sessionContentAlignment.left
source: Left
ar: يسار
de: Links
es: Izquierda
fr: Gauche
ja: 左
ko: 왼쪽
zh_hans: 左对齐
zh_hant: 靠左

# settings.terminal.sessionContentAlignment.right
source: Right
ar: يمين
de: Rechts
es: Derecha
fr: Droite
ja: 右
ko: 오른쪽
zh_hans: 右对齐
zh_hant: 靠右

# settings.terminal.sessionContentAlignment.subtitle
source: Places width-capped content within the pane.
ar: يضع المحتوى محدود العرض داخل الجزء.
de: Platziert in der Breite begrenzten Inhalt innerhalb des Teilfensters.
es: Coloca el contenido con límite de ancho dentro del panel.
fr: Positionne le contenu limité en largeur à l’intérieur du volet.
ja: 幅を制限したコンテンツをペイン内に配置します。
ko: 너비가 제한된 콘텐츠를 분할 창 내에 배치합니다.
zh_hans: 决定限宽内容在窗格中的位置。
zh_hant: 將限制寬度的內容置於窗格內。

# settings.terminal.sessionContentWidth
source: Session Content Width
ar: عرض محتوى الجلسة
de: Sitzungsinhaltsbreite
es: Ancho del contenido de la sesión
fr: Largeur du contenu de la session
ja: セッションコンテンツの幅
ko: 세션 콘텐츠 너비
zh_hans: 会话内容宽度
zh_hant: 工作階段內容寬度

# settings.terminal.sessionContentWidth.subtitleOff
source: Terminal and agent chat content uses the full pane width.
ar: يستخدم محتوى الطرفية ودردشة الوكيل العرض الكامل للجزء.
de: Terminal- und Agenten-Chat-Inhalte nutzen die gesamte Breite des Teilfensters.
es: El contenido de la terminal y del chat de agentes usa el ancho completo del panel.
fr: Le contenu du terminal et du chat de l'agent utilise toute la largeur du volet.
ja: ターミナルとエージェントチャットのコンテンツはペインの全幅を使います。
ko: 터미널 및 에이전트 채팅 콘텐츠가 분할 창의 전체 너비를 사용합니다.
zh_hans: 终端和代理对话内容使用窗格的完整宽度。
zh_hant: 終端機與代理對話內容會使用完整窗格寬度。

# settings.terminal.sessionContentWidth.subtitleOn
source: Terminal and agent chat content wraps within this width. Narrow panes still use all available space.
ar: يلتف محتوى الطرفية ودردشة الوكيل ضمن هذا العرض. تستمر الأجزاء الضيقة في استخدام كل المساحة المتاحة.
de: Terminal- und Agenten-Chat-Inhalte werden auf diese Breite umgebrochen. Schmale Teilfenster nutzen weiterhin den gesamten verfügbaren Platz.
es: El contenido de la terminal y del chat de agentes se ajusta dentro de este ancho. Los paneles estrechos siguen usando todo el espacio disponible.
fr: Le contenu du terminal et du chat de l’agent s’adapte à cette largeur. Les volets étroits continuent d’utiliser tout l’espace disponible.
ja: ターミナルとエージェントチャットのコンテンツはこの幅内で折り返します。狭いペインでは利用可能な幅をすべて使います。
ko: 터미널 및 에이전트 채팅 콘텐츠가 지정된 너비 내에서 줄바꿈됩니다. 좁은 분할 창에서는 사용 가능한 모든 공간을 계속 사용합니다.
zh_hans: 终端和代理对话内容在此宽度内换行。窄窗格仍会使用全部可用空间。
zh_hant: 終端機與代理對話內容會限制在此寬度內換行。狹窄的窗格仍會使用所有可用空間。

# settings.terminal.sessionContentWidth.toggle
source: Limit session content width
ar: تحديد عرض محتوى الجلسة
de: Sitzungsinhaltsbreite begrenzen
es: Limitar ancho del contenido de la sesión
fr: Limiter la largeur du contenu de la session
ja: セッションコンテンツの幅を制限
ko: 세션 콘텐츠 너비 제한
zh_hans: 限制会话内容宽度
zh_hant: 限制工作階段內容寬度

# settings.terminal.tabBarFontSize
source: Tab Bar Font Size
ar: حجم خط شريط علامات التبويب
de: Schriftgröße der Tab-Leiste
es: Tamaño de fuente de la barra de pestañas
fr: Taille de police de la barre d'onglets
ja: タブバーのフォントサイズ
ko: 탭 바 글꼴 크기
zh_hans: 标签栏字号
zh_hant: 標籤列字型大小

# settings.terminal.tabBarFontSize.reset
source: Reset
ar: إعادة تعيين
de: Zurücksetzen
es: Restablecer
fr: Réinitialiser
ja: リセット
ko: 재설정
zh_hans: 重置
zh_hant: 重置

# settings.terminal.tabBarFontSize.saveFailed
source: Couldn't save tab bar font size. Please try again.
ar: تعذر حفظ حجم خط شريط علامات التبويب. يرجى المحاولة مرة أخرى.
de: Schriftgröße der Tab-Leiste konnte nicht gespeichert werden. Bitte versuchen Sie es erneut.
es: No se pudo guardar el tamaño de fuente de la barra de pestañas. Inténtalo de nuevo.
fr: Impossible d’enregistrer la taille de la police de la barre d’onglets. Veuillez réessayer.
ja: タブバーのフォントサイズを保存できませんでした。もう一度お試しください。
ko: 탭 바 글꼴 크기를 저장할 수 없습니다. 다시 시도해 주세요.
zh_hans: 无法保存标签栏字号。请重试。
zh_hant: 無法儲存標籤列字型大小。請再試一次。

# settings.terminal.tabBarFontSize.subtitle
source: Controls the font size of the terminal and browser tab titles at the top of each pane.
ar: يتحكم في حجم خط عناوين علامات تبويب الطرفية والمتصفح في الجزء العلوي من كل جزء.
de: Steuert die Schriftgröße der Terminal- und Browser-Tab-Titel oben in jedem Teilfenster.
es: Controla el tamaño de fuente de los títulos de las pestañas de la terminal y del navegador en la parte superior de cada panel.
fr: Contrôle la taille de la police des titres d’onglets du terminal et du navigateur en haut de chaque volet.
ja: 各ペーン上部のターミナルとブラウザのタブタイトルのフォントサイズを調整します。
ko: 각 분할 창의 상단에 있는 터미널 및 브라우저 탭 제목의 글꼴 크기를 조절합니다.
zh_hans: 控制每个窗格顶部终端和浏览器标签页标题的字号。
zh_hant: 控制每個窗格頂端終端機與瀏覽器標籤頁標題的字型大小。

# settings.terminal.textBoxMaxLines
source: TextBox Max Lines
ar: الحد الأقصى لأسطر مربع النص
de: Maximale Zeilen der TextBox
es: Líneas máximas del cuadro de texto
fr: Nombre maximal de lignes de la TextBox
ja: TextBox の最大行数
ko: TextBox 최대 줄 수
zh_hans: TextBox 最大行数
zh_hant: 文字框最大行數

# settings.terminal.textBoxMaxLines.subtitle
source: Limits how tall the rich terminal input can grow before it scrolls.
ar: يحدد أقصى ارتفاع يمكن أن يصل إليه إدخال الطرفية الغني قبل أن يتطلب التمرير.
de: Begrenzt, wie hoch das Rich-Terminal-Eingabefeld wachsen kann, bevor es scrollt.
es: Limita la altura que puede alcanzar la entrada enriquecida de la terminal antes de desplazarse.
fr: Limite la hauteur que la saisie riche du terminal peut atteindre avant l’apparition du défilement.
ja: リッチなターミナル入力欄がスクロールする前に広がれる最大の高さを制限します。
ko: 서식 있는 터미널 입력 창이 스크롤되기 전까지 확장할 수 있는 최대 높이를 제한합니다.
zh_hans: 限制富文本终端输入框在开始滚动前能长到多高。
zh_hant: 限制進階終端機輸入在需要捲動前可增長的高度上限。

# settings.textBox.betaWarning
source: TextBox is a beta feature. Its defaults and behavior may change while it is being tested.
ar: مربع النص ميزة تجريبية. قد تتغير إعداداته الافتراضية وسلوكه أثناء اختباره.
de: TextBox ist eine Beta-Funktion. Standardwerte und Verhalten können sich während der Testphase ändern.
es: TextBox es una característica beta. Sus valores predeterminados y comportamiento pueden cambiar mientras se prueba.
fr: La TextBox est une fonctionnalité bêta. Ses valeurs par défaut et son comportement peuvent changer pendant sa phase de test.
ja: TextBox はベータ機能です。テスト中のため、既定値や動作が変わる場合があります。
ko: TextBox는 베타 기능입니다. 테스트되는 동안 기본값 및 동작이 변경될 수 있습니다.
zh_hans: TextBox 是测试版功能。在测试期间，默认值和行为可能会变化。
zh_hant: 文字框是一項 Beta 功能。在測試期間，其預設值與行為可能會發生變更。

# settings.textBox.defaultSubmitAction
source: Default Submit Action
ar: إجراء الإرسال الافتراضي
de: Standard-Absendeaktion
es: Acción de envío predeterminada
fr: Action d'envoi par défaut
ja: デフォルトの送信アクション
ko: 기본 제출 작업
zh_hans: 默认提交动作
zh_hant: 預設送出動作

# settings.textBox.defaultSubmitAction.subtitle
source: Used for new terminal sessions. Active Claude, Codex, OpenCode, and Pi sessions always submit as text entry.
ar: يستخدم لجلسات الطرفية الجديدة. تقوم جلسات Claude و Codex و OpenCode و Pi النشطة دائمًا بالإرسال كإدخال نصي.
de: Wird für neue Terminal-Sitzungen verwendet. Aktive Claude-, Codex-, OpenCode- und Pi-Sitzungen senden Eingaben immer als Texteintrag.
es: Se usa para nuevas sesiones de terminal. Las sesiones activas de Claude, Codex, OpenCode y Pi siempre se envían como entrada de texto.
fr: Utilisé pour les nouvelles sessions de terminal. Les sessions actives Claude, Codex, OpenCode et Pi envoient toujours sous forme de texte saisi.
ja: 新しいターミナルセッションで使います。アクティブな Claude、Codex、OpenCode、Pi セッションでは常にテキスト入力として送信します。
ko: 새 터미널 세션에 사용됩니다. 활성화된 Claude, Codex, OpenCode, Pi 세션은 항상 텍스트 입력으로 제출됩니다.
zh_hans: 用于新的终端会话。活动的 Claude、Codex、OpenCode 和 Pi 会话始终以文本输入方式提交。
zh_hant: 用於新的終端機工作階段。作用中的 Claude、Codex、OpenCode 與 Pi 工作階段會始終以文字輸入形式送出。

# settings.textBox.focusOnNewTerminals
source: Focus TextBox on New Terminals
ar: تركيز مربع النص في الطرفيات الجديدة
de: Fokus auf TextBox bei neuen Terminals
es: Enfocar el cuadro de texto en nuevas terminales
fr: Placer le focus sur la TextBox pour les nouveaux terminaux
ja: 新しいターミナルで TextBox にフォーカス
ko: 새 터미널 생성 시 TextBox에 포커스
zh_hans: 在新终端中聚焦 TextBox
zh_hant: 在新終端機上聚焦文字框

# settings.textBox.focusOnNewTerminals.subtitleOff
source: New terminals keep keyboard focus in the terminal surface.
ar: تحتفظ الطرفيات الجديدة بتركيز لوحة المفاتيح في سطح الطرفية.
de: Neue Terminals behalten den Tastaturfokus auf der Terminal-Oberfläche.
es: Las nuevas terminales mantienen el enfoque del teclado en la superficie de la terminal.
fr: Les nouveaux terminaux conservent le focus du clavier sur la surface d’affichage du terminal.
ja: 新しいターミナルではキーボードフォーカスをターミナル面に置きます。
ko: 새 터미널은 키보드 포커스를 터미널 화면에 그대로 유지합니다.
zh_hans: 新终端会将键盘焦点保留在终端表面中。
zh_hant: 新終端機會將鍵盤焦點保持在終端機介面中。

# settings.textBox.focusOnNewTerminals.subtitleOn
source: New terminal tabs, splits, and workspaces put keyboard focus in the TextBox.
ar: تضع علامات تبويب الطرفية الجديدة، والتقسيمات، ومساحات العمل تركيز لوحة المفاتيح في مربع النص.
de: Neue Terminal-Tabs, Aufteilungen und Arbeitsbereiche setzen den Tastaturfokus in die TextBox.
es: Las nuevas pestañas de terminal, divisiones y espacios de trabajo ponen el enfoque del teclado en el cuadro de texto.
fr: Les nouveaux onglets, divisions et espaces de travail de terminal placent le focus du clavier sur la TextBox.
ja: 新しいターミナルタブ、分割、ワークスペースではキーボードフォーカスを TextBox に置きます。
ko: 새 터미널 탭, 분할 및 작업 공간 생성 시 키보드 포커스를 TextBox에 둡니다.
zh_hans: 新的终端标签页、拆分和工作区会将键盘焦点放入 TextBox。
zh_hant: 新終端機標籤頁、分割與工作區會將鍵盤焦點置於文字框中。

# settings.textBox.maxLines
source: TextBox Max Lines
ar: الحد الأقصى لأسطر مربع النص
de: Maximale Zeilen der TextBox
es: Líneas máximas del cuadro de texto
fr: Nombre maximal de lignes de la TextBox
ja: TextBox の最大行数
ko: TextBox 최대 줄 수
zh_hans: TextBox 最大行数
zh_hant: 文字框最大行數

# settings.textBox.maxLines.subtitle
source: Limits how tall the rich terminal input can grow before it scrolls.
ar: يحدد أقصى ارتفاع يمكن أن يصل إليه إدخال الطرفية الغني قبل أن يتطلب التمرير.
de: Begrenzt, wie hoch das Rich-Terminal-Eingabefeld wachsen kann, bevor es scrollt.
es: Limita la altura que puede alcanzar la entrada enriquecida de la terminal antes de desplazarse.
fr: Limite la hauteur que la saisie riche du terminal peut atteindre avant l’apparition du défilement.
ja: リッチなターミナル入力欄がスクロールする前に広がれる最大の高さを制限します。
ko: 서식 있는 터미널 입력 창이 스크롤되기 전까지 확장할 수 있는 최대 높이를 제한합니다.
zh_hans: 限制富终端输入在滚动前可增长的最大高度。
zh_hant: 限制進階終端機輸入在需要捲動前可增長的高度上限。

# settings.textBox.showOnNewTerminals
source: Show TextBox on New Terminals
ar: إظهار مربع النص على الطرفيات الجديدة
de: TextBox bei neuen Terminals anzeigen
es: Mostrar el cuadro de texto en nuevas terminales
fr: Afficher la TextBox pour les nouveaux terminaux
ja: 新しいターミナルで TextBox を表示
ko: 새 터미널 생성 시 TextBox 표시
zh_hans: 在新终端中显示 TextBox
zh_hant: 在新終端機上顯示文字框

# settings.textBox.showOnNewTerminals.subtitleOff
source: New terminals start with the TextBox hidden until you open it.
ar: تبدأ الطرفيات الجديدة بمربع النص مخفيًا حتى تقوم بفتحه.
de: Neue Terminals starten mit ausgeblendeter TextBox, bis Sie sie öffnen.
es: Las nuevas terminales comienzan con el cuadro de texto oculto hasta que lo abras.
fr: Les nouveaux terminaux démarrent avec la TextBox masquée jusqu'à ce que vous l’ouvriez.
ja: 新しいターミナルでは、開くまで TextBox を非表示にします。
ko: 새 터미널은 사용자가 열기 전까지 TextBox가 숨겨진 상태로 시작합니다.
zh_hans: 新终端启动时会隐藏 TextBox，直到你打开它。
zh_hant: 新終端機啟動時預設隱藏文字框，直到您開啟為止。

# settings.textBox.showOnNewTerminals.subtitleOn
source: New terminal tabs, splits, and workspaces open with the TextBox visible.
ar: تفتح علامات تبويب الطرفيات والتقسيمات ومساحات العمل الجديدة مع ظهور مربع النص.
de: Neue Terminal-Tabs, Aufteilungen und Arbeitsbereiche öffnen sich mit sichtbarer TextBox.
es: Las nuevas pestañas de terminal, divisiones y espacios de trabajo se abren con el cuadro de texto visible.
fr: Les nouveaux onglets, divisions et espaces de travail de terminal s’ouvrent avec la TextBox visible.
ja: 新しいターミナルタブ、分割、ワークスペースでは TextBox を表示して開きます。
ko: 새 터미널 탭, 분할 및 작업 공간이 생성될 때 TextBox가 보이는 상태로 열립니다.
zh_hans: 新的终端标签页、拆分和工作区会在打开时显示 TextBox。
zh_hant: 新終端機標籤頁、分割與工作區開啟時將會顯示文字框。

# settings.textBox.submitAction.claude
source: Claude Dangerous
ar: Claude (وضع خطير)
de: Claude (gefährlicher Modus)
es: Claude (modo peligroso)
fr: Claude (mode dangereux)
ja: Claude（危険モード）
ko: Claude(위험 모드)
zh_hans: Claude（危险模式）
zh_hant: Claude（危險模式）

# settings.textBox.submitAction.opencode
source: OpenCode
ar: كود مفتوح
es: código abierto
fr: Code Ouvert
ko: 오픈코드
zh_hans: 开放代码
zh_hant: 開放程式碼

# settings.textBox.submitAction.textEntry
source: Text Entry
ar: إدخال النص
de: Texteingabe
es: Entrada de texto
fr: Saisie de texte
ja: テキスト入力
ko: 텍스트 입력
zh_hans: 文本输入
zh_hant: 文字輸入

# settings.title
source: Settings
ar: الإعدادات
bs: Postavke
da: Indstillinger
de: Einstellungen
es: Ajustes
fr: Réglages
it: Impostazioni
ja: 設定
ko: 설정
nb: Innstillinger
pl: Ustawienia
pt_br: Ajustes
ru: Настройки
th: การตั้งค่า
tr: Ayarlar
uk: Налаштування
zh_hans: 设置
zh_hant: 設定

# settings.window.runtimeUnavailable
source: Settings could not load. Please restart cmux and report this issue.
ar: تعذّر تحميل الإعدادات. يُرجى إعادة تشغيل cmux والإبلاغ عن هذه المشكلة.
bs: Postavke se nisu mogle učitati. Ponovo pokrenite cmux i prijavite ovaj problem.
da: Indstillingerne kunne ikke indlæses. Genstart cmux, og rapportér dette problem.
de: Die Einstellungen konnten nicht geladen werden. Bitte starte cmux neu und melde dieses Problem.
es: No se pudieron cargar los ajustes. Reinicia cmux e informa de este problema.
fr: Impossible de charger les réglages. Veuillez redémarrer cmux et signaler ce problème.
it: Impossibile caricare le impostazioni. Riavvia cmux e segnala questo problema.
ja: 設定を読み込めませんでした。cmux を再起動して、この問題を報告してください。
ko: 설정을 불러올 수 없습니다. cmux를 다시 시작하고 이 문제를 신고해 주세요.
nb: Innstillingene kunne ikke lastes. Start cmux på nytt og rapporter dette problemet.
pl: Nie udało się wczytać ustawień. Uruchom cmux ponownie i zgłoś ten problem.
pt_br: Não foi possível carregar os ajustes. Reinicie o cmux e informe este problema.
ru: Не удалось загрузить настройки. Перезапустите cmux и сообщите об этой проблеме.
th: ไม่สามารถโหลดการตั้งค่าได้ โปรดรีสตาร์ท cmux และรายงานปัญหานี้
tr: Ayarlar yüklenemedi. Lütfen cmux'u yeniden başlatın ve bu sorunu bildirin.
uk: Не вдалося завантажити налаштування. Перезапустіть cmux і повідомте про цю проблему.
zh_hans: 无法加载设置。请重启 cmux 并报告此问题。
zh_hant: 無法載入設定。請重新啟動 cmux 並回報此問題。

# settings.workspaceColors.base
source: Base: %@
ar: الأساس: %@
bs: Osnovna: %@
de: Basis: %@
ja: ベース: %@
ko: 기본: %@
nb: Basis: %@
pl: Bazowy: %@
ru: Базовый: %@
th: ฐาน: %@
tr: Temel: %@
uk: Базовий: %@
zh_hans: 基础色：%@
zh_hant: 基底：%@

# settings.workspaceColors.customColors
source: Custom Colors
ar: ألوان مخصصة
bs: Prilagođene boje
da: Brugerdefinerede farver
de: Benutzerdefinierte Farben
es: Colores personalizados
fr: Couleurs personnalisées
it: Colori personalizzati
ja: カスタムカラー
ko: 사용자 지정 색상
nb: Egendefinerte farger
pl: Własne kolory
pt_br: Cores Personalizadas
ru: Пользовательские цвета
th: สีที่กำหนดเอง
tr: Özel Renkler
uk: Власні кольори
zh_hans: 自定义颜色
zh_hant: 自訂顏色

# settings.workspaceColors.customEntry
source: Named palette entry.
ar: عنصر لوحة ألوان مسمى.
de: Benannter Paletteneintrag.
es: Entrada de paleta con nombre.
fr: Entrée de palette nommée.
ja: 名前付きのパレット項目です。
ko: 이름이 지정된 팔레트 항목.
zh_hans: 命名调色板条目。
zh_hant: 已命名的調色盤項目。

# settings.workspaceColors.dictionaryNote
source: Edit cmux.json to add or remove named colors. "Choose Custom Color..." still adds local Custom N entries.
ar: قم بتحرير cmux.json لإضافة أو إزالة الألوان المسماة. لا يزال "Choose Custom Color..." يضيف إدخالات Custom N المحلية.
de: Bearbeiten Sie cmux.json, um benannte Farben hinzuzufügen oder zu entfernen. "Benutzerdefinierte Farbe wählen..." fügt weiterhin lokale Einträge vom Typ "Custom N" hinzu.
es: Edita cmux.json para añadir o eliminar colores con nombre. "Choose Custom Color..." sigue añadiendo entradas locales de Custom N.
fr: Modifiez cmux.json pour ajouter ou supprimer des couleurs nommées. "Choisir une couleur personnalisée..." ajoute toujours des entrées locales Custom N.
ja: 名前付きカラーの追加や削除は cmux.json を編集してください。「カスタムカラーを選択…」は引き続きローカルの Custom N エントリを追加します。
ko: cmux.json을 편집하여 이름이 지정된 색상을 추가하거나 제거하세요. "사용자 지정 색상 선택..."으로 로컬 Custom N 항목을 추가할 수 있습니다.
zh_hans: 编辑 cmux.json 可添加或移除命名颜色。「选取自定义颜色...」仍会添加本地的「自定义 N」条目。
zh_hant: 編輯 cmux.json 以新增或移除命名的顏色。「選擇自訂顏色...」仍會新增本機的「自訂 N」項目。

# settings.workspaceColors.emptyPalette
source: No palette entries. Add colors in cmux.json or use "Choose Custom Color..." from a workspace context menu.
ar: لا توجد عناصر في لوحة الألوان. أضف ألوانًا في cmux.json أو استخدم "Choose Custom Color..." من القائمة السياقية لمساحة العمل.
de: Keine Paletteneinträge. Fügen Sie Farben in cmux.json hinzu oder verwenden Sie "Benutzerdefinierte Farbe wählen..." aus dem Kontextmenü eines Arbeitsbereichs.
es: Sin entradas de paleta. Añade colores en cmux.json o usa "Choose Custom Color..." desde el menú contextual de un espacio de trabajo.
fr: Aucune entrée dans la palette. Ajoutez des couleurs dans cmux.json ou utilisez "Choisir une couleur personnalisée..." depuis un menu contextuel d'espace de travail.
ja: パレット項目はありません。cmux.json でカラーを追加するか、ワークスペースのコンテキストメニューから「カスタムカラーを選択…」を使ってください。
ko: 팔레트 항목이 없습니다. cmux.json에서 색상을 추가하거나 워크스페이스 컨텍스트 메뉴의 "사용자 지정 색상 선택..."을 사용하세요.
zh_hans: 没有调色板条目。请在 cmux.json 中添加颜色，或在工作区右键菜单中使用「选取自定义颜色...」。
zh_hant: 調色盤無任何項目。請在 cmux.json 中新增顏色，或從工作區右鍵選單中使用「選擇自訂顏色...」

# settings.workspaceColors.indicator
source: Workspace Color Indicator
ar: مؤشر لون مساحة العمل
bs: Indikator boje radnog prostora
da: Arbejdsområdefarveindikator
de: Arbeitsbereichsfarb-Indikator
es: Indicador de color del espacio de trabajo
fr: Indicateur de couleur d'espace de travail
it: Indicatore colore area di lavoro
ja: ワークスペースカラーインジケーター
ko: 작업 공간 색상 표시기
nb: Arbeidsområdefarge-indikator
pl: Wskaźnik koloru przestrzeni roboczej
pt_br: Indicador de Cor da Área de Trabalho
ru: Индикатор цвета рабочего пространства
th: ตัวบ่งชี้สีเวิร์กสเปซ
tr: Çalışma Alanı Renk Göstergesi
uk: Індикатор кольору робочої області
zh_hans: 工作区颜色指示器
zh_hant: 工作區顏色指示器

# settings.workspaceColors.noCustomColors
source: Custom colors: none yet. Use "Choose Custom Color..." from a workspace context menu.
ar: ألوان مخصصة: لا يوجد بعد. استخدم "اختيار لون مخصص..." من قائمة سياق مساحة العمل.
bs: Prilagođene boje: još nema. Koristite "Odaberi prilagođenu boju..." iz kontekstnog menija radnog prostora.
da: Brugerdefinerede farver: ingen endnu. Brug "Vælg brugerdefineret farve..." fra en arbejdsområdekontekstmenu.
de: Benutzerdefinierte Farben: noch keine. Verwenden Sie 'Eigene Farbe wählen ...' im Kontextmenü eines Arbeitsbereichs.
es: Colores personalizados: ninguno aún. Usa "Elegir color personalizado…" desde el menú contextual de un espacio de trabajo.
fr: Couleurs personnalisées : aucune pour le moment. Utilisez « Choisir une couleur personnalisée... » depuis le menu contextuel d'un espace de travail.
it: Colori personalizzati: nessuno. Usa "Scegli colore personalizzato..." dal menu contestuale di un'area di lavoro.
ja: カスタムカラー: まだありません。ワークスペースのコンテキストメニューから「カスタムカラーを選択…」を使用してください。
ko: 사용자 지정 색상: 아직 없습니다. 작업 공간 컨텍스트 메뉴에서 "사용자 지정 색상 선택..."을 사용하세요.
nb: Egendefinerte farger: ingen ennå. Bruk «Velg egendefinert farge ...» fra en arbeidsområde-kontekstmeny.
pl: Własne kolory: jeszcze żadnych. Użyj „Wybierz własny kolor…” z menu kontekstowego przestrzeni roboczej.
pt_br: Cores personalizadas: nenhuma ainda. Use "Escolher Cor Personalizada..." no menu de contexto de uma área de trabalho.
ru: Пользовательские цвета: пока нет. Используйте «Выбрать пользовательский цвет...» из контекстного меню рабочего пространства.
th: สีที่กำหนดเอง: ยังไม่มี ใช้ "เลือกสีที่กำหนดเอง..." จากเมนูบริบทเวิร์กสเปซ
tr: Özel renkler: henüz yok. Bir çalışma alanı bağlam menüsünden "Özel Renk Seç..." seçeneğini kullanın.
uk: Власні кольори: ще немає. Використовуйте «Вибрати власний колір...» з контекстного меню робочої області.
zh_hans: 自定义颜色：暂无。请从工作区右键菜单中使用「选取自定义颜色...」。
zh_hant: 自訂顏色：尚無。請從工作區右鍵選單中使用「選擇自訂顏色...」。

# settings.workspaceColors.notificationBadgeColor
source: Notification Badge
ar: شارة الإشعارات
de: Benachrichtigungs-Badge
es: Insignia de notificación
fr: Badge de notification
ja: 通知バッジ
ko: 알림 배지
zh_hans: 通知角标
zh_hant: 通知徽章

# settings.workspaceColors.notificationBadgeColor.reset
source: Reset
ar: إعادة تعيين
de: Zurücksetzen
es: Restablecer
fr: Réinitialiser
ja: リセット
ko: 재설정
zh_hans: 重置
zh_hant: 重置

# settings.workspaceColors.notificationBadgeColor.subtitle
source: Color of the unread notification badge on workspace tabs.
ar: لون شارة الإشعارات غير المقروءة على علامات تبويب مساحة العمل.
de: Farbe des ungelesenen Benachrichtigungs-Badges auf Arbeitsbereich-Tabs.
es: Color de la insignia de notificación no leída en las pestañas del espacio de trabajo.
fr: Couleur du badge de notification non lue sur les onglets d’espace de travail.
ja: ワークスペースタブの未読通知バッジの色。
ko: 작업 공간 탭에 표시되는 읽지 않은 알림 배지의 색상입니다.
zh_hans: 工作区标签页上未读通知角标的颜色。
zh_hant: 工作區標籤頁上未讀通知徽章的顏色。
